{ "stages": 
[
{   
	"page": 1,
	"narrative": "The clamour of the excited spectators gadually fades behind you as vou venture deep lnto the gloom of the cavern tunnel. Large crystals hang from the tunnel roof at twenty meter intervals, radiating a soft light, just enough for you to see your way.  As your eyes gradually become accustomed to the near-darkness, you begin to see movement all around. Spiders and beetles crawling up and down the chiselled walls disappear quickly into cracks and crevices as they sense your approach; rats and mice scurry along the floor ahead of you. Droplets o{ water drip into small pools with an eerie plopping sound which echoes down the tunnel The ail is cold, moist and dank. After walking slowly along the tunnel for about five minutes, you arive at a stone table standrng against the wall to your left.",
	"action": "choose",
	"options": [
	  {"choice": "(o)pen box?", "next": 270, "key": "o"},
	  {"choice": "Go (n)orth",  "next": 66,  "key": "n"}
	]
  },
  {
	"page": 66,
	"narrative": "After walking down the tunnel for a few minutes, you come to a junction. A white arrow Painted on one wall points west.  On the floor you can see wet footprints made by those who entered before you. It is hard to be sure, but it looks as though three of them followed the direction of the arrow, while one decided to go east. ",
	"action": "choose",
	"options": [
		 {"choice": "Head (w)est", "next": 293, "key": "w"},
	  	{"choice": "Head (e)ast", "next": 119, "key": "e"}
	  ]
  },
	{
	  "page": 293,
	  "narrative":
	  "Following the three sets of wet footprints along the west passage of the tunnel, you soon arrive at a junction.",
	"action": "choose",
	  "options": [
		{"choice": "Head (w)est", "next": 137, "key": "w"},
		{"choice": "Head (n)orth", "next": 387, "key": "n"}
		]
	},
	{
        "page": 387,
        "narrative": 
        "Ahead you hear the thud of heavy footsteps approaching. Out of lhe gloom steps a large, primitive being dressed in animal hide and carrying a stone club. On seeing you, he grunts and spits onthe floor, then raises his club and lumbers on towards you, lookrng anything but friendly. You draw your sword and prepare to fight the CAVEMAN.",
		"action": "fight",
        "options": [
           {"choice": "win", "next": 114, "key": "w"}
          ], 
        "characters": [
          {"name": "Caveman", "type": "caveman", "stats": {"skill": 7, "stamina": 7}}
        ]
    }
]
}


